rails-marathon-completed/app/controllers/members_controller.rb

  def create
    @member = Member.new(member_params)
    @house = House.find(params[:house_id])
    #why house_id I had:
    @member.house = @house
    #and it should work right?
    # @member.house_id = @house.id

    if @member.save
---
INSERT INTO "members" ("first_name", "last_name", "house_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "Edmure"], ["last_name", "Tully"], ["house_id", 183], ["created_at", 2017-10-13 01:12:20 UTC], ["updated_at", 2017-10-13 01:12:20 UTC]]